# Забавные строки.
# Демонстрирует сцепление иповторение строк
print("Две строки можно" + "сцепить с помощью оператора '+'.")
print("\nЭта строка "+ "вряд ли " + "удив" + "ит вас. "
      + "Но интересно, " + "что" + " она - \n" + "одна длинная-длин"
      + "на" + "я" +" строка. Сцепленная " + "из " + " двадцати двух\n"
      + "отдельных строк." + " Разбитых " + "на шесть строк."
      + " Достаточно ли вы" + " впечатлены? "
      + "Ну хватит.\n" + "Вот " + "наша " + "длинная" + " строка и закончилась.")
print("\nЕсли текст нравится, его можно и повторить. К примеру.")
print("Кто не любит пироженных? Только дурак не любит пироженных. А")
print("раз мы люди честные, то выскажемся о своих симпатиях")
print("откровенно:")
print("Пироженные " * 10)
input("\n\nНажмите nter, чтобы выйти.")