# Текстовые задачи.
# Демонстрирует математические операции.
print("Если беременная самка бегемота массой в 800 ккг родит детеныша массой 40 кг.")
print("Но за тем съест 20 кг корма, то сколько она будет всего весить?")
input("Чтобы узнать нажмите Enter.")
print("800 - 40 -20 =", 800 - 40 + 20)

print("\nЕсли студент, возвращаясь с успешно сданного экзамена, на радостях")
print("купил каждому из 6 друзей по 3 бутылки пива, то сколько всего бутылок пива "
      "купленно?")
input("Чтобы узнать нажмите Enter.")
print("6 * 3 =", 6 * 3)

print("\nЕсли в ресторане вам с приятелями принесли счет на 19 доллоров (считая "
      "чаевые).")
print("и вы решили скинуться по ровну на четверых, то сколько придется с каждого?")
input("Чтобы узнать нажмите Enter.")
print("19 / 4 =", 19 / 4)

print("\nЕсли четверо пиратов найдут ларчик, в котором ровно 107 золотых монет, и")
print("решат разделить добычу поровну, то сколько целых монет достанется каждому?")
input("Чтобы узнать нажмите Enter.")
print("107 // 4 =", 107 // 4)

print("\nЕсли те же самые 10 пиратов разделят те же 107 монет из ларчика поровну,")
print(" то сколько останится ничейных монет?")
input("Чтобы узнать нажмите Enter.")
print("107 % 4 =", 107 % 4)